<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>139 Breve historia sobre Python</title>
</head>
<body>
<h1>Breve Historia sobre Python</h1>
<p>Python fue creado a finales de los ochenta por Guido van Rossum en CWI en los Pa&iacute;ses Bajos como un sucesor del lenguaje de programaci&oacute;n ABC, capaz de manejar excepciones e interactuar con el sistema operativo Amoeba.</p>
<p>Van Rossum es el principal autor de Python, y su continuo rol central en decidir la direcci&oacute;n de Python es reconocido, refiri&eacute;ndose a &eacute;l como Benevolente dictador vitalicio o Benevolent Dictator for Life (BDFL).</p>
<p>En 1991, van Rossum public&oacute; el c&oacute;digo (versi&oacute;n 0.9.0) en alt.sources. En esta etapa del desarrollo ya estaban presentes clases con herencia, manejo de excepciones, funciones, y los tipos modulares: list, dict, str y as&iacute; sucesivamente. Adem&aacute;s en este lanzamiento inicial aparec&iacute;a un sistema de m&oacute;dulos adoptado de Modula-3; van Rossum describe el m&oacute;dulo como "uno de las mayores unidades de programaci&oacute;n de Python". El modelo de excepciones en Python es parecido al de Modula-3, con la adici&oacute;n de una cl&aacute;usula else . En el a&ntilde;o 1994 se form&oacute; comp.lang.python, el foro de discusi&oacute;n principal de Python, marcando un hito en el crecimiento del grupo de usuarios de este lenguaje. Python alcanz&oacute; la versi&oacute;n 1.0 en enero de 1994. Una caracter&iacute;stica de este lanzamiento fueron las herramientas de la programaci&oacute;n funcional: lambda, map, filtery reduce. Van Rossum explic&oacute; que "Hace 12 a&ntilde;os, Python adquiri&oacute; lambda, reduce(), filter() and map(), cortes&iacute;a de un hacker de Lisp que las extra&ntilde;aba y que envi&oacute; parches."6 El donante fue Amrit Prem; no se hace ninguna menci&oacute;n espec&iacute;fica de cualquier herencia de Lisp en las notas de lanzamiento.</p>
<p>La &uacute;ltima versi&oacute;n liberada proveniente de CWI fue Python 1.2. En 1995, van Rossum continu&oacute; su trabajo en Python en la Corporation for National Research Initiatives (CNRI) en Reston, Virginia, donde lanz&oacute; varias versiones del software.</p>
<p>En el a&ntilde;o 2000, el principal equipo de desarrolladores de Python se cambi&oacute; a BeOpen.com para formar el equipo BeOpen PythonLabs. CNRI pidi&oacute; que la versi&oacute;n 1.6 fuera p&uacute;blica, continuando su desarrollo hasta que el equipo de desarrollo abandon&oacute; CNRI; su programa de lanzamiento y el de la versi&oacute;n 2.0 ten&iacute;an una significativa cantidad de traslapo. Python 2.0 fue el primer y &uacute;nico lanzamiento de BeOpen.com. Despu&eacute;s que Python 2.0 fuera publicado por BeOpen.com, Guido van Rossum y los otros desarrolladores PythonLabs se unieron en Digital Creations.</p>
<p>Python 2.0 tom&oacute; una caracter&iacute;stica mayor del lenguaje de programaci&oacute;n funcional Haskell: list comprehensions. La sintaxis de Python para esta construcci&oacute;n es muy similar a la de Haskell, salvo por la preferencia de los caracteres de puntuaci&oacute;n en Haskell, y la preferencia de Python por palabras claves alfab&eacute;ticas. Python 2.0 introdujo adem&aacute;s un sistema de recolecci&oacute;n de basura capaz de recolectar referencias c&iacute;clicas.</p>
<p>Posterior a este doble lanzamiento, y despu&eacute;s que van Rossum dej&oacute; CNRI para trabajar con desarrolladores de software comercial, qued&oacute; claro que la opci&oacute;n de usar Python con software disponible bajo GPL era muy deseable. La licencia usada entonces, la Python License, inclu&iacute;a una cl&aacute;usula estipulando que la licencia estaba gobernada por el estado de Virginia, por lo que, bajo la &oacute;ptica de los abogados de Free Software Foundation (FSF), se hac&iacute;a incompatible con GNU GPL. CNRI y FSF se relacionaron para cambiar la licencia de software libre de Python para hacerla compatible con GPL. En el a&ntilde;o 2001, van Rossum fue premiado con FSF Award for the Advancement of Free Software.</p>
<p>Durante su estancia en CNRI, van Rossum lanz&oacute; la iniciativa Computer Programming for Everybody (CP4E), con el fin de hacer la programaci&oacute;n m&aacute;s accesible a m&aacute;s gente, con un nivel de 'alfabetizaci&oacute;n' b&aacute;sico en lenguajes de programaci&oacute;n, similar a la alfabetizaci&oacute;n b&aacute;sica en ingl&eacute;s y habilidades matem&aacute;ticas necesarias por muchos trabajadores. Python tuvo un papel crucial en este proceso: debido a su orientaci&oacute;n hacia una sintaxis limpia, ya era id&oacute;neo, y las metas de CP4E presentaban similitudes con su predecesor, ABC. El proyecto fue patrocinado por DARPA. En el a&ntilde;o 2007, el proyecto CP4E est&aacute; inactivo, y mientras Python intenta ser f&aacute;cil de aprender y no muy arcano en su sintaxis y sem&aacute;ntica, alcanzando a los no-programadores, no es una preocupaci&oacute;n activa.</p>
<p>Python 1.6.1 es esencialmente el mismo que Python 1.6, con unos pocos arreglos de bugs, y con una nueva licencia compatible con GPL. Python 2.1 fue un trabajo derivado de Python 1.6.1, as&iacute; como tambi&eacute;n de Python 2.0. Su licencia fue renombrada: Python Software Foundation License. Todo el c&oacute;digo, documentaci&oacute;n y especificaciones a&ntilde;adidas, desde la fecha del lanzamiento de la versi&oacute;n alfa de Python 2.1, tiene como due&ntilde;o a Python Software Foundation (PSF), una organizaci&oacute;n sin &aacute;nimo de lucro fundada en el a&ntilde;o 2001, tomando como modelo laApache Software Foundation. Incluido en este lanzamiento fue una implementaci&oacute;n del scoping m&aacute;s parecida a las reglas de static scoping (del cual Scheme es el originador).</p>
<p>Una innovaci&oacute;n mayor en Python 2.2 fue la unificaci&oacute;n de los tipos en Python (tipos escritos en C), y clases (tipos escritos en Python) dentro de una jerarqu&iacute;a. Esa unificaci&oacute;n logr&oacute; un modelo de objetos de Python puro y consistente. Tambi&eacute;n fueron agregados los generadores que fueron inspirados por el lenguaje Icon.</p>
<p>Las adiciones a la biblioteca est&aacute;ndar de Python y las decisiones sint&aacute;cticas fueron influenciadas fuertemente por Java en algunos casos: el package logging,14 introducido en la versi&oacute;n 2.3, el parser SAX, introducido en 2.0, y la sintaxis del patr&oacute;n decoratorque usa el @,agregado en la versi&oacute;n 2.4</p>
<p>&nbsp;</p>
<p>Para ver mas detalles visite&nbsp;<a href="https://es.wikipedia.org/wiki/Python">https://es.wikipedia.org/wiki/Python</a></p>
<p>Siempre podra visitar informacion detallada en el sitio oficial de Python&nbsp;<a href="https://www.python.org/">https://www.python.org/</a></p>
<p>&nbsp;</p>

</body>
</html>
